<script setup lang="ts">
import Header from '~/components/Header.vue';
import MyWorks from '~/components/MyWorks.vue';
import Technologies from '~/components/Technologies.vue';
import Contacts from '~/components/Contacts.vue';
</script>

<template>
    <div class="h-full dark:bg-[#000000]">
        <div class="max-w-[900px] mx-auto px-[50px]">

            <Header />

            <main>
                <h2 class="main_text mt-[30px]">
                    Меня зовут Валентин, и я являюсь frontend разработчиком. Моя основная специализация заключается в
                    создании современных и функциональных веб-сайтов, а также мобильных приложений, которые помогают
                    пользователям решать их задачи и улучшать взаимодействие с цифровыми продуктами.
                </h2>

                <MyWorks />

                <h2 class="main_text">
                    У меня есть опыт работы в стартапах, который составляет 1 год и 3 месяца. За это время
                    я
                    успел погрузиться в различные технологии и инструменты, которые применяются в сфере разработки. Я
                    активно осваивал новые фреймворки и библиотеки, что позволило мне расширить свои навыки и улучшить
                    качество создаваемых мной проектов.
                </h2>

                <Technologies />

                <h2 class="main_text mt-[70px]">
                    Каждый новый проект для меня — это возможность не только применить уже имеющиеся знания, но и
                    научиться
                    чему-то новому, что, безусловно, способствует моему профессиональному росту. Я стремлюсь к тому,
                    чтобы
                    мои разработки были не только эстетически привлекательными, но и удобными для пользователей.
                </h2>

                <Contacts />
            </main>

            <footer class="flex text-[14px] mt-[100px] justify-center pb-[20px] text-[#949494]">
                © 2024
            </footer>

        </div>
    </div>
</template>